# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

In [2]:
import numpy as py

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [8]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/Stats/US_Baby_Names/US_Baby_Names_right.csv"

### Step 3. Assign it to a variable called baby_names.

In [10]:
baby_names = pd.read_csv("US_Baby_Names_right.csv",sep=',' )

### Step 4. See the first 10 entries

In [11]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [12]:
df = baby_names.drop(['Id','Unnamed: 0'], 1)

In [13]:
baby_names.columns

Index(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

In [14]:
df.columns

Index(['Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

### Step 6. Is there more male or female names in the dataset?

In [21]:
baby_names.groupby('Gender').size().head(1) #.reset_index(name = 'Count').sort_values(['Count'], ascending=False)

Gender
F    558846
dtype: int64

In [30]:
baby_names[['Gender']].groupby('Gender').count()

Empty DataFrame
Columns: []
Index: [F, M]

In [31]:
baby_names[['Gender']].groupby('Gender').count().head(1)

Empty DataFrame
Columns: []
Index: [F]

In [26]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [32]:
baby_names['Gender'].value_counts('F')

F    0.549832
M    0.450168
Name: Gender, dtype: float64

In [27]:
baby_names['Gender'].value_counts()['F']

558846

### Step 7. Group the dataset by name and assign to names

In [33]:
names = baby_names.groupby('Name')

In [45]:
baby_names.head(2)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48

In [40]:
#names.describe()

### Step 8. How many different names exist in the dataset?

In [39]:
len(names)

17632

In [42]:
names.Name.unique().count()

17632

### Step 9. What is the name with most occurrences?

In [53]:
#Dataframe groupby you have to convert into dataframe only . Then only u can do opertaion

In [54]:
#pd.DataFrame(names.size().reset_index(name = "Count")).sort_values(['Count'], ascending=False)

In [63]:
names = baby_names.groupby("Name").sum()

In [62]:
names

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
Name: Count, dtype: int64

In [64]:
names.sort_values("Count", ascending = 0).head()

          Unnamed: 0          Id     Year   Count
Name
Jacob     1665680788  1665681356  1141099  242874
Emma      1629481684  1629482250  1137085  214852
Michael   1687520717  1687521295  1161152  214405
Ethan     1660807908  1660808475  1139091  209277
Isabella  1630131220  1630131786  1137090  204798

### Step 10. How many different names have the least occurrences?

In [67]:
len(names[names['Count'] == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [68]:
len(names[names['Count'] == names.Count.median()])

66

### Step 12. What is the standard deviation of names?

In [70]:
 names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [71]:
 names.describe()

         Unnamed: 0            Id          Year          Count
count  1.763200e+04  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.631922e+08  1.158117e+05    2008.932169
std    3.504512e+08  3.504513e+08  2.451618e+05   11006.069468
min    8.606400e+04  8.606500e+04  2.004000e+03       5.000000
25%    4.918374e+06  4.918375e+06  4.017000e+03      11.000000
50%    1.963462e+07  1.963463e+07  1.606100e+04      49.000000
75%    1.071826e+08  1.071826e+08  7.846425e+04     337.000000
max    3.223035e+09  3.223036e+09  2.233993e+06  242874.000000